[
    {
        "name": "Black Panther",
        "Director": [
            "Ryan Coogler"
        ],
        "language": "English",
        "poster_image_url": "https://resizing.flixster.com/mpWKLuTKy3brg_P2EvyJs_EsoS4=/740x380/v2/https://statcdn.fandango.com/MPX/image/NBCU_Fandango/368/319/thumb_C6E9416B-3AF4-410A-AD72-2468E85D771D.jpg",
        "bio": "After the death of his father, T'Challa returns home to the African nation of Wakanda to take his rightful place as king. When a powerful enemy suddenly reappears, T'Challa's mettle as king -- and as Black Panther -- gets tested when he's drawn into a conflict that puts the fate of Wakanda and the entire world at risk. Faced with treachery and danger, the young king must rally his allies and release the full power of Black Panther to defeat his foes and secure the safety of his people.",
        "runtime": 134,
        "genre": [
            "Action",
            "Adventure"
        ]
    },
    {
        "name": "Avengers: Endgame",
        "Director": [
            "Anthony Russo",
            "Joe Russo"
        ],
        "language": "English",
        "poster_image_url": "https://resizing.flixster.com/QFUUNlvMyUZgrhIv5i4NVUAUAOs=/740x380/v2/https://statcdn.fandango.com/MPX/image/NBCU_Fandango/814/423/thumb_45C803B4-8FBD-4443-8632-3E4E3B62710B.jpg",
        "bio": "Adrift in space with no food or water, Tony Stark sends a message to Pepper Potts as his oxygen supply starts to dwindle. Meanwhile, the remaining Avengers -- Thor, Black Widow, Captain America and Bruce Banner -- must figure out a way to bring back their vanquished allies for an epic showdown with Thanos -- the evil demigod who decimated the planet and the universe.",
        "runtime": 181,
        "genre": [
            "Adventure",
            "Scifi",
            "Action"
        ]
    },
    {
        "name": "Mission: Impossible -- Fallout",
        "Director": [
            "Christopher McQuarrie"
        ],
        "language": "English",
        "poster_image_url": "https://resizing.flixster.com/JoVaADxH-BT-09UMIgrvTdP9iLQ=/740x380/v2/https://statcdn.fandango.com/MPX/image/NBCU_Fandango/262/903/thumb_6966CCA2-3C70-4000-8A7B-AA249B7BE8AE.jpg",
        "bio": "Ethan Hunt and the IMF team join forces with CIA assassin August Walker to prevent a disaster of epic proportions. Arms dealer John Lark and a group of terrorists known as the Apostles plan to use three plutonium cores for a simultaneous nuclear attack on the Vatican, Jerusalem and Mecca, Saudi Arabia. When the weapons go missing, Ethan and his crew find themselves in a desperate race against time to prevent them from falling into the wrong hands.",
        "runtime": 147,
        "genre": [
            "Mysterythriller",
            "Action"
        ]
    },
    {
        "name": "Mad Max: Fury Road",
        "Director": [
            "George Miller"
        ],
        "language": "English",
        "poster_image_url": "https://resizing.flixster.com/d13Nulbs9DJtfIE0hmssdbo2gBw=/740x380/v2/https://statcdn.fandango.com/MPX/image/NBCU_Fandango/6/818/MadMax_Trailer1_retaliate__906992.jpg",
        "bio": "Years after the collapse of civilization, the tyrannical Immortan Joe enslaves apocalypse survivors inside the desert fortress the Citadel. When the warrior Imperator Furiosa (Charlize Theron) leads the despot's five wives in a daring escape, she forges an alliance with Max Rockatansky (Tom Hardy), a loner and former captive. Fortified in the massive, armored truck the War Rig, they try to outrun the ruthless warlord and his henchmen in a deadly high-speed chase through the Wasteland.",
        "runtime": 120,
        "genre": [
            "Adventure"
        ]
    },
    {
        "name": "Spider-Man: Into the Spider-Verse",
        "Director": [
            "Bob Persichetti",
            "Peter Ramsey",
            "Rodney Rothman"
        ],
        "language": "English",
        "poster_image_url": "https://resizing.flixster.com/HretIYZsGM1KHM-v5uO9mHDrTaY=/740x380/v2/https://statcdn.fandango.com/MPX/image/NBCU_Fandango/68/491/thumb_B72C5F5A-51EB-4021-8176-2A9E2C0E8818.jpg",
        "bio": "Bitten by a radioactive spider in the subway, Brooklyn teenager Miles Morales suddenly develops mysterious powers that transform him into the one and only Spider-Man. When he meets Peter Parker, he soon realizes that there are many others who share his special, high-flying talents. Miles must now use his newfound skills to battle the evil Kingpin, a hulking madman who can open portals to other universes and pull different versions of Spider-Man into our world.",
        "runtime": 117,
        "genre": [
            "Animation",
            "Action",
            "Adventure",
            "Kidsfamily",
            "Comedy"
        ]
    },
    {
        "name": "Wonder Woman",
        "Director": [
            "Patty Jenkins"
        ],
        "language": "English",
        "poster_image_url": "https://resizing.flixster.com/OlVcj-jcwkZoL0txFve9s5wyI0k=/740x380/v2/https://statcdn.fandango.com/MPX/image/NBCU_Fandango/28/399/thumb_445A2346-6E26-44B2-8B11-8CD17B09DBFF.jpg",
        "bio": "Before she was Wonder Woman (Gal Gadot), she was Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, Diana meets an American pilot (Chris Pine) who tells her about the massive conflict that's raging in the outside world. Convinced that she can stop the threat, Diana leaves her home for the first time. Fighting alongside men in a war to end all wars, she finally discovers her full powers and true destiny.",
        "runtime": 141,
        "genre": [
            "Action",
            "Adventure"
        ]
    },
    {
        "name": "Logan",
        "Director": [
            "James Mangold"
        ],
        "language": "English",
        "poster_image_url": "https://resizing.flixster.com/N0lBQPzvr0z4eoKF2tzV4nrLUhU=/740x380/v2/https://statcdn.fandango.com/MPX/image/NBCU_Fandango/889/855/logan_bluraytrailer1.jpg",
        "bio": "In the near future, a weary Logan (Hugh Jackman) cares for an ailing Professor X (Patrick Stewart) at a remote outpost on the Mexican border. His plan to hide from the outside world gets upended when he meets a young mutant (Dafne Keen) who is very much like him. Logan must now protect the girl and battle the dark forces that want to capture her.",
        "runtime": 137,
        "genre": [
            "Action",
            "Adventure"
        ]
    },
    {
        "name": "Coco",
        "Director": [
            "Lee Unkrich"
        ],
        "language": "English",
        "poster_image_url": "https://resizing.flixster.com/ZWxnspjV7BcyV3B_8ZPOpOUO9eg=/740x380/v2/https://statcdn.fandango.com/MPX/image/NBCU_Fandango/709/1010/coco_trailer2.jpg",
        "bio": "Despite his family's generations-old ban on music, young Miguel dreams of becoming an accomplished musician like his idol Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead. After meeting a charming trickster named Héctor, the two new friends embark on an extraordinary journey to unlock the real story behind Miguel's family history.",
        "runtime": 109,
        "genre": [
            "Music",
            "Comedy",
            "Adventure"
        ]
    },
    {
        "name": "Dunkirk",
        "Director": [
            "Christopher Nolan"
        ],
        "language": "English",
        "poster_image_url": "https://resizing.flixster.com/dxl_wKM53eZSrw-y3jBXii21b1I=/740x380/v2/https://statcdn.fandango.com/MPX/image/NBCU_Fandango/948/566/dunkirk_trailer2.jpg",
        "bio": "In May 1940, Germany advanced into France, trapping Allied troops on the beaches of Dunkirk. Under air and ground cover from British and French forces, troops were slowly and methodically evacuated from the beach using every serviceable naval and civilian vessel that could be found. At the end of this heroic mission, 330,000 French, British, Belgian and Dutch soldiers were safely evacuated.",
        "runtime": 107,
        "genre": [
            "History",
            "War"
        ]
    },
    {
        "name": "Star Wars: The Last Jedi",
        "Director": [
            "Rian Johnson"
        ],
        "language": "English",
        "poster_image_url": "https://resizing.flixster.com/_m2iQwIHogO5DrHmv86VKPU6AR4=/740x380/v2/https://statcdn.fandango.com/MPX/image/NBCU_Fandango/111/975/thumb_A6D174D9-A79E-49C8-B241-43B779F443BE.jpg",
        "bio": "Luke Skywalker's peaceful and solitary existence gets upended when he encounters Rey, a young woman who shows strong signs of the Force. Her desire to learn the ways of the Jedi forces Luke to make a decision that changes their lives forever. Meanwhile, Kylo Ren and General Hux lead the First Order in an all-out assault against Leia and the Resistance for supremacy of the galaxy.",
        "runtime": 152,
        "genre": [
            "Scifi",
            "Action",
            "Adventure"
        ]
    }
]